performance-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
  variables:
    duration: 0
  payload:
    path: "test-data.csv"
    fields:
      - "duration"

scenarios:
  - name: "Performance test"
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.duration"
              as: "duration"
            - json: "$.error"
              as: "error"
          expect:
            - statusCode: 200